---
kind: method
id: M:Autodesk.Revit.DB.WorksharingUtils.Dispose
source: html/260ca2a7-7757-529e-228e-e3c511904af7.htm
---
# Autodesk.Revit.DB.WorksharingUtils.Dispose Method

Releases all resources used by the WorksharingUtils

## Syntax (C#)
```csharp
public void Dispose()
```